Repository: YordanSoares/teligro
Catalog: languages/wp-telegram-pro-*.po
Languages: fa_ir

source: Disable
fa_ir: غیرفعال

source: Word
fa_ir: کلمه

source: Goto <a href="%s">script.google.com</a> and sign in if required.
fa_ir: به <a href="%s">script.google.com</a> بروید و در صورت نیاز وارد شوید.

source: Inline button title
fa_ir: عنوان دکمه درون خطی

source: Copy the "Current web app URL" and paste it in plugin
fa_ir: مقدار "Current web app URL" کپی کنید و در افزونه بچسبانید

source: Least 5 minutes recommended.
fa_ir: حداقل 5 دقیقه پیشنهاد می‌شود.

source: Delay in send
fa_ir: تاخیر در ارسال

source: After redirection, you should see "This project is now deployed as a web app"
fa_ir: بعد از هدایت به صفحه، شما باید "This project is now deployed as a web app." را ببینید

source: On the next screen, click "Allow"
fa_ir: در صفحه بعد، برروی "Allow" کلیک کنید.

source: In the popup window select your Google Account
fa_ir: در پنجره باز شده حساب کاربری گوگل خود را انتخاب کنید

source: Click "Review Permissions" to authorize the script
fa_ir: برای مجوز دادن به اسکریپت برروی "Review Permissions" کلیک کنید

source: Click "Deploy" to open the Authorization box
fa_ir: برای بازد شدن جعبه تایید مجوز برروی "Deploy" کلیک کنید

source: In "Who has access to the app:", select "Anyone, even anonymous" [IMPORTANT]
fa_ir: در "Who has access to the app:"، گزینه "Anyone, even anonymous" را انتخاب کنید [مهم]

source: In "Execute the app as:", select "Me (your email)" [IMPORTANT]
fa_ir: در "Execute the app as:"، گزینه "Me (ایمیل شما)" را انتخاب کنید [مهم]

source: If asked, Enter any name for the project and click "OK"
fa_ir: در صورت درخواست، هر نامی را برای پروژه وارد کنید و روی "OK" کلیک کنید

source: Click "Publish" from the menu and select "Deploy as web app..."
fa_ir: از منوی "Publish" گزینه "Deploy as web app..." را انتخاب کنید

source: Click File > Save or press Ctrl+S
fa_ir: منوی File » گزینه Save یا کلیدهای Ctrl+S فشار دهید

source: Copy the contents of below code and paste into your project file (Code.gs)
fa_ir: محتوای کدهای زیر را کپی و در فایل پروژه خود بچسبانید (Code.gs).

source: It should open a file (Code.gs by default). Remove the contents of this file
fa_ir: باید فایل را باز کند (پیشفرض Code.gs). محتویات این فایل را حذف کنید

source: Create a new project and give it a name
fa_ir: یک پروژه جدید ایجاد کنید و نام برای آن انتخاب کنید

source: How to Deploy
fa_ir: نحوه استفاده

source: You can use this script to bypass the bans on Telegram API by different hosts. Simply send the request to this script instead of the Telegram Bot API after deploying it as a web app and allowing anonymous access.
fa_ir: شما می‌توانید از این اسکریپت برای جلوگیری از ممنوعیت Telegram API توسط میزبان‌های مختلف استفاده کنید. به سادگی درخواست به این اسکریپت مانند Telegram Bot API است، بعد از استقرار به عنوان برنامه وب و دادن مجوز دسترسی افراد ناشناس.

source: See help tab
fa_ir: زبانه راهنما را ببینید

source: The plugin requires SSL in the domain of your website!
fa_ir: افزونه نیاز به SSL برای دامنه سایت شما دارد!

source: Password
fa_ir: رمزعبور

source: Leave empty if not required
fa_ir: اگر ضروری نیست، خالی بگذارید

source: Username
fa_ir: نام کاربری

source: Proxy Type
fa_ir: نوع پروکسی

source: Target Port like 8080
fa_ir: شماره پورت مانند 8080

source: Proxy Port
fa_ir: پورت پروکسی

source: Host IP or domain name like 192.168.55.124
fa_ir: IP هاست یا نام دامنه مانند 192.168.55.124

source: Proxy Host
fa_ir: هاست پروکسی

source: The requests to Telegram will be sent via your Google Script.
fa_ir: ارسال درخواست به تلگرام از گوگل اسکریپت شما انجام می‌شود.

source: Google Script URL
fa_ir: نشانی گوگل اسکریپت

source: PHP Proxy
fa_ir: پروکسی PHP

source: Google Script
fa_ir: گوگل اسکریپت

source: Deactive
fa_ir: غیرفعال

source: Use the proxy at your own risk!
fa_ir: خطر استفاده از پروکسی برعهده شماست!

source: DISCLAIMER
fa_ir: سلب مسئولیت

source: Proxy
fa_ir: پروکسی

source: Empty the cart
fa_ir: خالی کردن سبد

source: You should update keyboard for users when change WordPress language, active Woocommerce plugin, search setting changed. (Status don't save)
fa_ir: در هر زمانی که زبان وردپرس را تغییر داید، یا افزونه ووکامرس را فعال کردید، یا تظیمات جستجو را تغییر دادید نیاز هست که کیبورد را بروز کنید. (وضعیت این گزینه ذخیره نمی‌شود)

source: Force update keyboard
fa_ir: بروزرسانی اجباری کیبورد

source: Telegram Keyboard
fa_ir: کیبورد تلگرام

source: Welcome!
fa_ir: خوش‌آمدید!

source: Update
fa_ir: بروزرسانی

source: Post
fa_ir: نوشته

source: IF Statement for custom field, Example: {if='cf:price'}Price: {cf:price}{/if}
fa_ir: شرط برای زمینه دلخواه، نمونه: {if='cf:price'}Price: {cf:price}{/if}

source: The Taxonomy Terms of this post: {terms:taxonomy}, Example {terms:category}
fa_ir: مقدارهای تاکسونامی این نوشته: {terms:taxonomy}، نمونه: {terms:category}

source: The custom field of this post, Example {cf:price}
fa_ir: زمینه دلخواه این نوشته، نمونه {cf:price}

source: [Set 'channel' attribute]
fa_ir: [مشخصه 'channel' را تنظیم کنید]

source: Category
fa_ir: دسته

source: Page
fa_ir: برگه

source: Product
fa_ir: محصول

source: Galleries
fa_ir: گالری

source: < Previous Page
fa_ir: « صفحه قبلی

source: Next Page >
fa_ir: صفحه بعدی »

source: < Previous
fa_ir: « قبلی

source: Next >
fa_ir: بعدی »

source: [API Token or Channel Username Invalid]
fa_ir: [کلید API یا نام‌کاربری معتبر نیست]

source: - Select a Tag -
fa_ir: - برچسبی را انتخاب کنید -

source: Web page preview in messages
fa_ir: پیش‌نمایش لینک در پیام‌ها

source: Excerpt length
fa_ir: طول چکیده متن

source: Markdown
fa_ir: Markdown (زبان نشانه‌گذاری)

source: Simple
fa_ir: ساده

source: Telegram Bot API
fa_ir: API بات تلگرام

source: Telegram supports basic markdown and some HTML tags (bold, italic, inline links). By checking one of the following options, your messages will be compatible with Telegram format.
fa_ir: تلگرام از زبان نشانه‌گذاری/Markdown و چندی از HTML Tags (ضخیم, کج, لینک) پشتیبانی می‌کند. با انتخاب هر گزینه زیر، پیام شما با قالب تلگرام سازگار می‌شود.

source: Formatting messages
fa_ir: قالب‌بندی پیام‌ها

source: With featured image?
fa_ir: همراه تصویر شاخص؟

source: Active on PostType
fa_ir: فعال در نوع نوشته

source: Send to channel (Default)
fa_ir: ارسال به کانال (پیشفرض)

source: Channel Username
fa_ir: نام‌کاربری کانال

source: Add Channel
fa_ir: افزودن کانال

source: Work with <a href="%s" target="_blank">WP-Cron</a>.
fa_ir: اجرا با <a href="%s" target="_blank">WP-Cron</a>.

source: Minutes
fa_ir: دقیقه

source: Check send every
fa_ir: بررسی ارسال هر

source: Send to Channels
fa_ir: ارسال به کانال

source: API Token or Channel Username Invalid, It may not have access to the channel! (Read Help)
fa_ir: کلید API یا نام‌کاربری معتبر نیست، شاید امکان دسترسی به کانال وجود ندارد! (راهنما را بخوانید)

source: Channel Member Count:
fa_ir: تعداد اعضای کانال:

source: Attache featured Image
fa_ir: پیوست تصویر شاخص

source: Message Pattern
fa_ir: الگوی پیام

source: Send to Channel
fa_ir: ارسال به کانال

source: Post Type
fa_ir: نوع نوشته

source: Notification
fa_ir: اطلاع‌رسانی

source: Start Command<br>(Welcome Message)
fa_ir: دستور شروع<br>(پیام خوش‌آمدگویی)

source: Messages
fa_ir: پیامها

source: Image Size
fa_ir: اندازه تصویر

source: Posts Per Page
fa_ir: تعداد نوشته در هر برگه

source: Telegram Bot API Token
fa_ir: کلید API بات تلگرام

source: WordPress
fa_ir: وردپرس

source: Not Found Comment!
fa_ir: نظری پیدا نشد!

source: Spam
fa_ir: جفنگ

source: Approve
fa_ir: تایید

source: Unapprove
fa_ir: تایید نکردن

source: Restore from Trash
fa_ir: بازگردانی از زباله‌دان

source: Trash
fa_ir: زباله‌دان

source: New Status:
fa_ir: وضعیت جدید:

source: Post Category Invalid!
fa_ir: دسته نوشته معتبر نیست!

source: Enter word for search:
fa_ir: واژه‌ای برای جستجو وارد کنید:

source: Comment
fa_ir: دیدگاه

source: Website
fa_ir: وبسایت

source: Email
fa_ir: ایمیل

source: Author
fa_ir: نویسنده

source: New Comment
fa_ir: دیدگاه جدید

source: The featured image URL
fa_ir: لینک تصویر شاخص

source: The categories of this post. Categories are automatically separated by | symbol
fa_ir: دسته‌های نوشته، دسته‌ها به صورت خودکار با حرف | جدا می‌شوند

source: The tags of this post. Tags are automatically converted to Telegram hashtags
fa_ir: برچسب‌های نوشته، برچسب‌ها به صورت خودکاربه هشتگ تبدیل می‌شوند

source: The short url of this post
fa_ir: لینک کوتاه نوشته

source: The permalink of this post
fa_ir: لینک نوشته

source: The permalink of this author posts
fa_ir: لینک برگه نویسنده نوشته

source: The display name of author of this post
fa_ir: نمایش نام نویسنده نوشته

source: The whole content of this post
fa_ir: محتوای کامل نوشته

source: The first 55 words of this post
fa_ir: ۵۵ کلمه اول نوشته

source: The Slug of this post
fa_ir: پیوند یکتای نوشته

source: The title of this post
fa_ir: عنوان نوشته

source: The ID of this post
fa_ir: شناسه (ID) نوشته

source: WordPress Tags
fa_ir: برچسب‌های وردپرس

source: Set Webhook with Error!
fa_ir: خطا در تنظیم وب‌هوک!

source: Set Webhook Successfully.
fa_ir: وب‌هوک با موفقیت تنظیم شد.

source: Categories List
fa_ir: لیست دسته‌ها

source: Start Bot
fa_ir: شروع بات

source: User connect to:
fa_ir: اتصال کاربر به:

source: Telegram User
fa_ir: کاربر تلگرام

source: Your request without result!
fa_ir: درخواست شما پاسخی ندارد!

source: Select
fa_ir: انتخاب

source: Category Buttons
fa_ir: دکمه دسته

source: Gallery Button
fa_ir: دکمه گالری

source: Keyboard
fa_ir: کیبورد

source: Rating
fa_ir: امتیاز

source: Attributes
fa_ir: خواص

source: Dimensions
fa_ir: اندازه

source: Weight
fa_ir: وزن

source: Meta Data
fa_ir: دیگر داده‌ها

source: Display
fa_ir: نمایش

source: After Payment Complete
fa_ir: بعد از کامل شدن پرداخت

source: Active
fa_ir: فعال

source: After Redirect to Cart Page
fa_ir: بعد از هدایت کاربر به سبدخرید

source: Exclude Display Categories
fa_ir: نمایش ندادن دسته‌ها

source: Exclude Categories
fa_ir: دسته‌های استثنا

source: Products Per Page
fa_ir: محصولات در هر برگه

source: WooCommerce
fa_ir: ووکامرس

source: Product Category Invalid!
fa_ir: دسته محصول معتبر نیست!

source: Please select product variations:
fa_ir: متغیرهای محصول را انتخاب کنید:

source: Add to Cart:
fa_ir: افزودن به سبدخرید:

source: Remove from Cart:
fa_ir: حذف از سبدخرید:

source: The product does not exist
fa_ir: محصول یافت نشد

source: Back to Product
fa_ir: برگشت به محصول

source: Is this product visible? (Yes or No)
fa_ir: این محصول قالب نمایش است؟ (بله یا خیر)

source: Is this a featured product? (Yes or No)
fa_ir: این محصول شاخص است؟ (بله یا خیر)

source: Whether or not backorders allowed?
fa_ir: اجازه پیش‌ فروش محصول؟

source: The stock status of this product
fa_ir: وضعیت موجودی محصول

source: The stock amount of this product
fa_ir: تعداد موجودی محصول

source: The tax class of this product
fa_ir: دسته مالیات محصول

source: The tax status of this product
fa_ir: وضعیت مالیات محصول

source: Is this product sold individually? (Yes or No)
fa_ir: این محصول به صورت تکی فروش میرود؟ (بله یا خیر)

source: Is this product virtual? (Yes or No)
fa_ir: این محصول مجازی هست؟ (بله یا خیر)

source: Is this product downloadable? (Yes or No)
fa_ir: این محصول قابل دانلود هست؟ (بله یا خیر)

source: The SKU (Stock Keeping Unit) of this product
fa_ir: واحد انبارداری محصول (SKU)

source: The average rating of this product
fa_ir: متوسط امتیاز محصول

source: The dimensions of this product
fa_ir: اندازه محصول

source: The weight of this product
fa_ir: وزن محصول

source: The height of this product
fa_ir: ارتفاع محصول

source: The length of this product
fa_ir: طول محصول

source: The width of this product
fa_ir: عرض محصول

source: The sale price of this product
fa_ir: قیمت حراجی محصول

source: The regular price of this product
fa_ir: قیمت عادی محصول

source: The price of this product
fa_ir: قیمت محصول

source: WooCommerce Tags
fa_ir: برچسب‌های ووکامرس

source: Out of stock
fa_ir: موجود نیست

source: In stock
fa_ir: موجود هست

source: Refresh Cart
fa_ir: بروزرسانی سبدخرید

source: Cart has been empty.
fa_ir: سبدخرید خالی است.

source: Empty Cart?
fa_ir: خالی کردن سبدخرید؟

source: Your cart is empty.
fa_ir: سبدخرید شما خالی است.

source: Checkout
fa_ir: پرداخت

source: Product Categories
fa_ir: دسته‌های محصول

source: Cart
fa_ir: سبدخرید

source: Product Categories List
fa_ir: لیست دسته‌های محصول

source: Products
fa_ir: محصولات

source: Every % Minutes
fa_ir: هر % دقیقه

source: - Category Select -
fa_ir: - انتخاب دسته -

source: Crop
fa_ir: بُرِش خورده

source: Full
fa_ir: کامل

source: Save
fa_ir: ذخیره

source: Settings saved.
fa_ir: تنظیمات ذخیره شد.

source: Remove % Channel?
fa_ir: حذف کانال %؟

source: New Channel
fa_ir: کانال جدید

source: Welcome, your user is successfully connected to the store.
fa_ir: خوش‌ آمدید، کاربری شما با موفقیت به فروشگاه متصل شد.

source: API Token Invalid (Need to save settings)
fa_ir: کلید API معتبر نیست (نیازمند ذخیره تنظیمات)

source: Bot Name:
fa_ir: نام بات:

source: Keep in touch with me:
fa_ir: با من در تماس باشید:

source: Give it a rating
fa_ir: امتیاز دهید

source: Do you like WP Telegram Pro?
fa_ir: WP Telegram Pro را دوست دارید؟

source: Yes! Now, whenever you publish or update a post you can choose whether send it to Telegram (from post editor page)
fa_ir: بله! اکنون هر وقت نوشته‌ای را منتشر یا بروز می‌کنید، می‌توانید انتخاب کنید چگونه به تلگرام ارسال شود (از برگه ویرایش نوشته)

source: Enter the username of the channel and hit SAVE button!!!
fa_ir: نام کاربری کانال را وارد کنید و دکمه ذخیره را فشار دهید!

source: Allow 'Post Messages' Permission
fa_ir: مجوز 'Post Messages' را بدهید

source: Search the username of your bot and add it as administrator.
fa_ir: نام‌کاربری بات خود را جستجو کنید و به عنوان Administrator به کانال اضافه کنید.

source: Select 'Add Administrator' option.
fa_ir: گزینه 'Add Administrator' را انتخاب کنید.

source: Go to channel options and select 'Administrator' option.
fa_ir: به تنظیمات کانال بروید و گزینه 'Administrator' را انتخاب کنید.

source: Create a bot (if you don't already have one).
fa_ir: باتی ایجاد کنید (اگر در حال حاضر ندارید)

source: Create a channel (if you don't already have one).
fa_ir: کانالی ایجاد کنید (اگر در حال حاضر ندارید)

source: Telegram channel is a great way for attracting people to your site.<br> This option allows you to send posts to your Telegram channel.
fa_ir: کانال تلگرام روش خوبی برای جذب افراد به سایت شما است.<br>با این گزینه شما می‌توانید نوشته‌های خود را به کانال تلگرام ارسال کنید.

source: Channel
fa_ir: کانال

source: How to set bot commands: Start %s and select your bot > "Edit Bot" > "Edit Commands" > Send text below.
fa_ir: چگونه دستورهای بات را تنظیم کنیم: با شروع %s و انتخاب بات خود » دکمه "Edit Bot" » دکمه "Edit Commands" » متن زیر را ارسال کنید.

source: Default command list:
fa_ir: لیست دستورهای پیشفرض:

source: About
fa_ir: درباره

source: Help
fa_ir: راهنما

source: More
fa_ir: بیشتر

source: Detail
fa_ir: جزییات

source: Categories
fa_ir: دسته‌ها

source: Search
fa_ir: جستجو

source: Posts
fa_ir: نوشته‌ها

source: Back
fa_ir: بازگشت

source: No
fa_ir: خیر

source: Yes
fa_ir: بله

source: Parsa Kafi
fa_ir: پارسا کافی

source: Integrate WordPress with Telegram
fa_ir: یکپارچه‌سازی وردپرس با تلگرام
